app/Http/Controllers/Auth/LoginController.php

select * from `user_logins` where `user_ip` = '127.0.0.1' limit 1
---
    public function authenticated(Request $request, $user)
    {
        if ($user->status == 0) {
            $notify[] = ['error','Your account has been deactivated.'];
            return redirect()->route('login')->withNotify($notify);
        }
        $user = auth()->user();
        $user->tv = $user->ts == 1 ? 0 : 1;
        $user->save();
        $ip = $_SERVER["REMOTE_ADDR"];
        $exist = UserLogin::where('user_ip',$ip)->first();

insert into `user_logins` (`longitude`, `latitude`, `city`, `country_code`, `country`, `user_id`, `user_ip`, `browser`, `os`, `updated_at`, `created_at`) values ('', '', '', '', '', 7, '127.0.0.1', 'Chrome', 'Windows 10', '2023-12-22 21:07:38', '2023-12-22 21:07:38')
---

            $userLogin->browser = @$userAgent['browser'];
            $userLogin->os = @$userAgent['os_platform'];
            $userLogin->save();