app/Http/Controllers/Staff/Auth/LoginController.php

select * from `user_logins` where `user_ip` = '127.0.0.1' limit 1
---
    public function authenticated(Request $request, $user)
    {

        if ($user->status == 0) {
            $this->guard()->logout();
            $notify[] = ['error','Your account has been deactivated.'];
            return redirect()->route('home')->withNotify($notify);
        }
        $user = auth()->user();
        $user->tv = $user->ts == 1 ? 0 : 1;
        $user->save();
        $ip = $_SERVER["REMOTE_ADDR"];
        $exist = UserLogin::where('user_ip',$ip)->first();

insert into `user_logins` (`longitude`, `latitude`, `city`, `country_code`, `country`, `user_id`, `user_ip`, `browser`, `os`, `updated_at`, `created_at`) values ('', '', '', '', '', 2, '127.0.0.1', 'Firefox', 'Windows 10', '2023-12-09 17:13:06', '2023-12-09 17:13:06')
---

        $userLogin->browser = @$userAgent['browser'];
        $userLogin->os = @$userAgent['os_platform'];
        $userLogin->save();