app/Http/Helpers/helpers.php

select `active_template` from `general_settings` limit 1
---
function activeTemplate($asset = false)
{
    $general = GeneralSetting::first(['active_template']);

select `active_template` from `general_settings` limit 1
---
function activeTemplateName()
{
    $general = GeneralSetting::first(['active_template']);

select * from `general_settings` limit 1
select * from `email_sms_templates` where `act` = 'MANAGER_CREATE' and `sms_status` = 1 limit 1
---
function sendSms($user, $type, $shortCodes = [])
{
    $general = GeneralSetting::first();
    $smsTemplate = SmsTemplate::where('act', $type)->where('sms_status', 1)->first();

select * from `general_settings` limit 1
---
function sendEmail($user, $type = null, $shortCodes = [])
{
    $general = GeneralSetting::first();

select * from `frontends` where `data_keys` = 'about.content' order by `id` desc limit 1
select * from `frontends` where `data_keys` = 'blog.element' order by `id` asc limit 3
select * from `frontends` where `data_keys` = 'counter.element' order by `id` desc limit 4
---
function getContent($data_keys, $singleQuery = false, $limit = null,$orderById = false)
{
    if ($singleQuery) {
        $content = Frontend::where('data_keys', $data_keys)->orderBy('id','desc')->first();
    } else {
        $article = Frontend::query();
        $article->when($limit != null, function ($q) use ($limit) {
            return $q->limit($limit);
        });
        if($orderById){
            $content = $article->where('data_keys', $data_keys)->orderBy('id')->get();
        }else{
            $content = $article->where('data_keys', $data_keys)->orderBy('id','desc')->get();

select * from `delivery_couriers` where `courier_id` = 19 order by `created_at` desc limit 1
---
function getStatus($id)
{
    $status = DeliveryCourier::where('courier_id',$id)->latest()->first()->status;

select * from `courier_infos` where `code` = 'MJAKK3KM1DS2' order by `created_at` desc limit 1
---
function getIdByNumber($orderNumber)
{
    $id = CourierInfo::where('code',$orderNumber)->latest()->first()->id;