app/Http/Controllers/Staff_Warehouse/CourierController.php

select * from `types` where `status` = 1 order by `created_at` desc
select * from `units` where `units`.`id` in (1)
---
    public function create()
    {
        $pageTitle = "Courier Send";
        $warehouses = Warehouse::where('status', 1)->latest()->get();
        $branchs = Branch::where('status', 1)->latest()->get();
        $types = Type::where('status', 1)->with('unit')->latest()->get();

select * from `courier_infos` where `sender_warehouse_id` = 1 or `receiver_warehouse_id` = 1 order by `id` desc limit 20 offset 0
select count(*) as aggregate from `courier_infos` where `sender_warehouse_id` = 1 or `receiver_warehouse_id` = 1
---
    public function manageCourierList()
    {
        $user = Auth::user();
        $pageTitle = "All Courier List";
        $emptyMessage = "No data found";
        $courierLists = CourierInfo::where('sender_warehouse_id', $user->warehouse_id)->orWhere('receiver_warehouse_id', $user->warehouse_id)->orderBy('id', 'DESC')->with('senderWarehouse', 'receiverWarehouse', 'senderStaff', 'receiverStaff', 'paymentInfo')->paginate(getPaginate());

select * from `courier_infos` where `courier_infos`.`id` = 8 limit 1
---
    public function details($id)
    {
        $pageTitle = "Courier Details";
        $courierInfo = CourierInfo::findOrFail(decrypt($id));

select * from `courier_payments` where `courier_payments`.`courier_info_id` in (17)
---
    public function invoice($id)
    {
        $pageTitle = "Invoice";
        $courierInfo = CourierInfo::where('id', decrypt($id))->first();
        $courierProductInfos = CourierProduct::where('courier_info_id', $courierInfo->id)->with('type')->get();
        $courierPayment = CourierPayment::where('courier_info_id', $courierInfo->id)->first();

select * from `courier_payments` where `courier_info_id` = 9 and `status` = 0 limit 1
insert into `admin_notifications` (`user_id`, `title`, `click_url`, `updated_at`, `created_at`) values (7, 'Courier Payment huystaff_warehouse', '/admin/courier/details/9', '2023-12-23 09:18:41', '2023-12-23 09:18:41')
---
    public function payment(Request $request)
    {
        $request->validate([
            'code' => 'required|exists:courier_infos,code'
        ]);
        $user = Auth::user();
        $courier = CourierInfo::where('code', $request->code)->where('status', 0)->firstOrFail();
        $courierPayment = CourierPayment::where('courier_info_id', $courier->id)->where('status', 0)->firstOrFail();
        $courierPayment->receiver_id = $user->id;
        $courierPayment->branch_id = $user->branch_id;
        $courierPayment->date = Carbon::now();
        $courierPayment->status = 1;
        $courierPayment->save();

        $adminNotification = new AdminNotification();
        $adminNotification->user_id = $user->id;
        $adminNotification->title = 'Courier Payment '.$user->username;
        $adminNotification->click_url = urlPath('admin.courier.info.details',$courier->id);
        $adminNotification->save();

select * from `courier_infos` where `receiver_warehouse_id` = 1 order by `id` desc limit 20 offset 0
select * from `warehouses` where `warehouses`.`id` in (3)
select count(*) as aggregate from `courier_infos` where `receiver_warehouse_id` = 1
---
    public function delivery()
    {
        $user = Auth::user();
        $pageTitle = "Courier Delivery List";
        $emptyMessage = "No data found";
        $courierDeliveys = CourierInfo::where('receiver_warehouse_id', $user->warehouse_id)->orderBy('id', 'DESC')->with('senderWarehouse','receiverWarehouse', 'senderStaff', 'receiverStaff', 'paymentInfo')->paginate(getPaginate());