app/Http/Controllers/Staff_Warehouse/CourierController.php

select * from `branches` where `status` = 1 order by `created_at` desc
select * from `branches` where `branches`.`id` in (6)
select * from `courier_infos` where `receiver_warehouse_id` = 4 and `status` = 2 or `status` = 4 order by `id` desc limit 20 offset 0
select * from `users` where `users`.`id` in (17)
select * from `warehouses` where `warehouses`.`id` in (3)
---
    public function create()
    {
        $pageTitle = "Courier Send";
        $emptyMessage = "No data found";
        $warehouses = Warehouse::where('status', 1)->latest()->get();
        $branchs = Branch::where('status', 1)->latest()->get();
        $courierLists = CourierInfo::where('status', 2)->orWhere('status', 4)->where('receiver_warehouse_id', Auth::user()->warehouse_id)->orderBy('id', 'DESC')->with('senderBranch', 'receiverBranch', 'senderStaff', 'receiverStaff', 'paymentInfo', 'senderWarehouse')->paginate(getPaginate());

select * from `courier_infos` where `id` = '13' and `status` = 2 or `status` = 4 limit 1
update `courier_infos` set `sender_warehouse_id` = 3, `sender_staff_id` = 17, `receiver_warehouse_id` = '4', `receiver_branch_id` = '0', `status` = 3, `courier_infos`.`updated_at` = '2023-12-24 17:06:32' where `id` = 13
---
    public function store(Request $request)
    {
        $request->validate([
            'branch' => 'required',
            'warehouse' => 'required',
            'couriers' => 'required',
        ]);
        $sender = Auth::user();

        for ($i=0; $i <count($request->couriers); $i++) {
            $courierInfos = CourierInfo::where('status', 2)->orWhere('status', 4)->where('id', $request->couriers[$i])->firstOrFail();
            $courierInfos->receiver_branch_id = $request->branch;
            $courierInfos->receiver_warehouse_id = $request->warehouse;
            $courierInfos->sender_staff_id = $sender->id;
            $courierInfos->sender_warehouse_id = $sender->warehouse_id;
            $courierInfos->status = $courierInfos->status + 1;
            $courierInfos->save();

select * from `branches` where `branches`.`id` in (6)
select * from `courier_infos` where `status` = 2 or `status` = 4 and `sender_warehouse_id` = 3 or `receiver_warehouse_id` = 3 order by `id` desc limit 20 offset 0
select * from `warehouses` where `warehouses`.`id` in (4)
select count(*) as aggregate from `courier_infos` where `status` = 2 or `status` = 4 and `sender_warehouse_id` = 3 or `receiver_warehouse_id` = 3
---
    public function manageCourierList()
    {
        $user = Auth::user();
        $pageTitle = "All Courier List";
        $emptyMessage = "No data found";
        $courierLists = CourierInfo::Where('status', 2)->orWhere('status', 4)->where('sender_warehouse_id', $user->warehouse_id)->orWhere('receiver_warehouse_id', $user->warehouse_id)->orderBy('id', 'DESC')->with('senderBranch', 'senderWarehouse', 'receiverWarehouse', 'senderStaff', 'receiverStaff', 'paymentInfo', 'senderStaffBranch')->paginate(getPaginate());

select * from `courier_infos` where `courier_infos`.`id` = 19 limit 1
---
    public function details($id)
    {
        $pageTitle = "Courier Details";
        $courierInfo = CourierInfo::findOrFail(decrypt($id));

select * from `courier_infos` where `id` = 13 limit 1
select * from `courier_products` where `courier_info_id` = 13
select * from `types` where `types`.`id` in (2)
select * from `courier_payments` where `courier_info_id` = 13 limit 1
---
    public function invoice($id)
    {
        $pageTitle = "Invoice";
        $courierInfo = CourierInfo::where('id', decrypt($id))->first();
        $courierProductInfos = CourierProduct::where('courier_info_id', $courierInfo->id)->with('type')->get();
        $courierPayment = CourierPayment::where('courier_info_id', $courierInfo->id)->first();

select * from `branches` where `branches`.`id` in (6)
select * from `courier_infos` where `receiver_warehouse_id` = 3 and `status` = 1 or `status` = 3 order by `id` desc limit 20 offset 0
select * from `warehouses` where `warehouses`.`id` in (3)
select count(*) as aggregate from `courier_infos` where `status` = 1 or `status` = 3 and `receiver_warehouse_id` = 3
---
    public function delivery()
    {
        $user = Auth::user();
        $pageTitle = "Courier Delivery List";
        $emptyMessage = "No data found";
        $courierDeliveys = CourierInfo::with('senderBranch', 'senderWarehouse','receiverWarehouse', 'senderStaff', 'receiverStaff', 'paymentInfo')->where('status',1)->orWhere('status', 3)->where('receiver_warehouse_id', $user->warehouse_id)->orderBy('id', 'DESC')->paginate(getPaginate());

select * from `courier_infos` where `code` = 'ADNCD12Y3H19' and `status` = 1 limit 1
---
    public function confirmStore(Request $request)
    {
        $request->validate([
            'code' => 'required|exists:courier_infos,code'
        ]);
        $user = Auth::user();
        $courier = CourierInfo::where('status', 1)->orWhere('status', 3)->where('code', $request->code)->firstOrFail();

select * from `branches` where `branches`.`id` in (1, 3)
---
    public function courierDateSearch(Request $request)
    {
        $user = Auth::user();
        $search = $request->date;
        if (!$search) {
            return back();
        }
        $date = explode('-',$search);
        $start = @$date[0];
        $end = @$date[1];
        $pattern = "/\d{2}\/\d{2}\/\d{4}/";
        if ($start && !preg_match($pattern,$start)) {
            $notify[] = ['error','Invalid date format'];
            return redirect()->route('admin.courier.info.index')->withNotify($notify);
        }
        if ($end && !preg_match($pattern,$end)) {
            $notify[] = ['error','Invalid date format'];
            return redirect()->route('admin.courier.info.index')->withNotify($notify);
        }
        $pageTitle = "Courier Search";
        $dateSearch = $search;
        $emptyMessage = "No data found";
        $courierLists = CourierInfo::where('sender_staff_id', $user->id)->orWhere('receiver_staff_id', $user->id)->whereBetween('created_at', [Carbon::parse($start), Carbon::parse($end)])->orderBy('id', 'DESC')->with('senderBranch', 'senderWarehouse', 'receiverWarehouse', 'senderStaff', 'receiverStaff', 'paymentInfo')->paginate(getPaginate());