app/Http/Controllers/Staff_Warehouse/HomeController.php

select * from `courier_infos` where `receiver_warehouse_id` = 1 order by `id` desc limit 5
---
    public function dashboard()
    {
        $user = Auth::user();
        $pageTitle = "Staff Dashboard";
        $emptyMessage = "No data found";
        $warehouseCount = Warehouse::where('status', 1)->count();
        $sendCourierCount = CourierInfo::where('sender_staff_id', $user->id)->count();
        $receivedCourierCount = CourierInfo::where('receiver_staff_id', $user->id)->count();
        $cashCollection = CourierPayment::where('receiver_id', $user->id)->sum('amount');
        $courierDeliveys = CourierInfo::where('receiver_warehouse_id', $user->warehouse_id)->orderBy('id', 'DESC')->with('senderWarehouse','receiverWarehouse', 'senderStaff', 'receiverStaff', 'paymentInfo')->take(5)->get();