{"Home":"Trang chủ","Blog":"Tin tức","Contact":"Liên hệ","Order Tracking":"Tra cứu mã đơn","Login":"Đăng nhập","Next":"Tiếp","Back":"Trở lại","Hello, everyone":"Xin chào, mọi người","Welcome to Magic Post":"Chào mừng đến với Magic Post","Have a good day":"Chúc bạn có 1 ngày tốt lành","We are the best service":"Chúng tôi là dịch vụ tốt nhất","Receive Goods":"Nhận hàng","They do not know how to avoid sufferings, they do not know how to refuse them, they hinder the very expedient, they are bound by pains, and error is born from them.":"Họ không biết cách tránh đau khổ, họ không biết cách từ chối họ, họ cản trở những điều tốt đẹp, họ bị đau khổ ràng buộc, và sinh ra lỗi lầm.","Submit Documents":"Gửi tài liệu","Tại sao chúng tôi là tốt nhất":"Tại sao chúng tôi là tốt nhất","30+ Years Experiences in Courier Service":"Hơn 30 năm kinh nghiệm trong dịch vụ chuyển phát nhanh","The pains due to the pains will be less, and the pain itself will be more severe from the rejection and the work that hinders it! Corrupted, otherwise laborious!":"Nỗi đau do nỗi đau sẽ bớt đi, và bản thân nỗi đau sẽ trầm trọng hơn do bị từ chối và công việc cản trở nó! Tham nhũng, nếu không thì tốn công sức!","We accuse the thing we lead by rejecting the body, abandoning it, fleeing or wanting. But of the body. All said and done, there are troubles indeed.":"Chúng ta buộc tội thứ mà chúng ta dẫn dắt bằng cách từ chối cơ thể, bỏ rơi nó, chạy trốn hoặc ham muốn. Nhưng của cơ thể. Tất cả đã nói và làm, thực sự có những rắc rối.","Company":"Công ty","Useful Link":"Liên kết","Get In Touch":"Liên lạc","Support":"Hỗ trợ","Our Blog Posts":"Trang tin tức","Is it not that these times are easy for the present, but the one who was born to receive the truth, the most pardon hinders him, the less he is prepared by the architect of the needs of pain? Little, nothing?":"Chẳng phải thời thế này dễ dàng đối với hiện tại, nhưng ai sinh ra để nhận được sự thật thì sự tha thứ nhất lại cản trở họ, thì người đó càng ít được chuẩn bị trước cho những nhu cầu đau đớn? Ít, không có gì?","Total Member":"Thành viên","Total Staffs":"Nhân viên","Total Branches":"Chi nhánh","Satisfied Client":"Khách hàng","Secured Services":"Dịch vụ đảm bảo","Lowest Cost":"Chi phí thấp nhất","Fast Delivery":"Chuyển phát nhanh","In order that I may not be blinded by refusals, there are such and such things, and other things which trouble me, often to debts.":"Để tôi không bị mù quáng trước những lời từ chối, có những điều này điều nọ, và những điều khác khiến tôi bận tâm, thường là các khoản nợ.","What We Serve":"Những gì chúng tôi phục vụ","Blessed are those who, through the wisdom of pains, achieve what seems to be the most worthy, softened, because there is some pleasure for us, and the harsher, the debtors should be the pleasures of the accusers.":"Phúc cho những ai, nhờ sự khôn ngoan của nỗi đau, đạt được điều tưởng chừng như xứng đáng nhất, nhẹ nhàng hơn, bởi vì có một niềm vui nào đó dành cho chúng ta, và càng khắc nghiệt hơn, con nợ phải là niềm vui của những kẻ buộc tội.","Warehousing":"Nhà kho","International Courier":"Chuyển phát nhanh quốc tế","Over Night Courier":"Chuyển phát nhanh qua đêm","Pallet Courier":"Pallet","Express Courier":"Dịch vụ chuyển phát nhanh","Standard Courier":"Chuyển phát nhanh tiêu chuẩn","Your Parcel Status":"Trạng thái bưu kiện của bạn","Track Now":"Tra cứu","Sender":"Người nhận"}