app/Http/Controllers/Staff/CourierController.php

    public function create()
    {
        $pageTitle = "Courier Send";
        $types = Type::where('status', 1)->with('unit')->latest()->get();
---
select * from `types` where `status` = 1 order by `created_at` desc
select * from `units` where `units`.`id` in (2)

    public function invoice($id)
    {
        $pageTitle = "Invoice";
        $courierInfo = CourierInfo::where('id', decrypt($id))->first();
        $courierProductInfos = CourierProduct::where('courier_info_id', $courierInfo->id)->with('type')->get();
        $courierPayment = CourierPayment::where('courier_info_id', $courierInfo->id)->first();
---
select * from `courier_payments` where `courier_payments`.`courier_info_id` in (13, 14, 15)

    public function manageCourierList()
    {
        $user = Auth::user();
        $pageTitle = "All Courier List";
        $emptyMessage = "No data found";
        $courierLists = CourierInfo::where('sender_branch_id', $user->branch_id)->orWhere('receiver_branch_id', $user->branch_id)->orderBy('id', 'DESC')->with('senderBranch', 'receiverBranch', 'senderStaff', 'receiverStaff', 'paymentInfo')->paginate(getPaginate());
---
select * from `branches` where `branches`.`id` in (6)
select * from `courier_infos` where `sender_branch_id` = 6 or `receiver_branch_id` = 6 order by `id` desc limit 20 offset 0
select count(*) as aggregate from `courier_infos` where `sender_branch_id` = 6 or `receiver_branch_id` = 6

    public function delivery()
    {
        $user = Auth::user();
        $pageTitle = "Courier Delivery List";
        $emptyMessage = "No data found";
        $courierDeliveys = CourierInfo::where('receiver_branch_id', $user->branch_id)->orderBy('id', 'DESC')->with('senderBranch','receiverBranch', 'senderStaff', 'receiverStaff', 'paymentInfo')->paginate(getPaginate());
---
select * from `branches` where `branches`.`id` in (6)

    public function dispatching()
    {
        $user = Auth::user();
        $pageTitle = "Courier Dispatch List";
        $emptyMessage = "No data found";
        $courierDispatchs = CourierInfo::where('sender_branch_id', $user->branch_id)->orderBy('id', 'DESC')->with('senderBranch','receiverBranch', 'senderStaff', 'receiverStaff', 'paymentInfo')->paginate(getPaginate());
---
select * from `branches` where `branches`.`id` in (6)
select * from `courier_infos` where `sender_branch_id` = 6 order by `id` desc limit 20 offset 0
select count(*) as aggregate from `courier_infos` where `sender_branch_id` = 6

    public function payment(Request $request)
    {
        $request->validate([
            'code' => 'required|exists:courier_infos,code'
        ]);
        $user = Auth::user();
        $courier = CourierInfo::where('code', $request->code)->where('status', 0)->firstOrFail();
        $courierPayment = CourierPayment::where('courier_info_id', $courier->id)->where('status', 0)->firstOrFail();
        $courierPayment->receiver_id = $user->id;
        $courierPayment->branch_id = $user->branch_id;
        $courierPayment->date = Carbon::now();
        $courierPayment->status = 1;
        $courierPayment->save();
---
select * from `courier_infos` where `code` = '3NDMARWPGBHD' and `status` = 0 limit 1
select * from `courier_payments` where `courier_info_id` = 17 and `status` = 0 limit 1
update `courier_payments` set `receiver_id` = 21, `branch_id` = 7, `date` = '2023-12-26 16:39:14', `status` = 1, `courier_payments`.`updated_at` = '2023-12-26 16:39:14' where `id` = 16

    public function deliveryStore(Request $request)
    {
        $request->validate([
            'code' => 'required|exists:courier_infos,code'
        ]);
        $user = Auth::user();
        $courier = CourierInfo::where('code', $request->code)->where('status', 0)->firstOrFail();
        $courier->receiver_staff_id = $user->id;
        $courier->status = 1;
        $courier->save();


        $adminNotification = new AdminNotification();
        $adminNotification->user_id = $user->id;
        $adminNotification->title = 'Courier Delivery '.$user->username;
        $adminNotification->click_url = urlPath('admin.courier.info.details',$courier->id);
        $adminNotification->save();
---
select * from `courier_infos` where `code` = 'OSGY7CDRB6JX' and `status` = 0 limit 1
update `courier_infos` set `receiver_staff_id` = 2, `status` = 1, `courier_infos`.`updated_at` = '2023-12-09 19:26:16' where `id` = 2
insert into `admin_notifications` (`user_id`, `title`, `click_url`, `updated_at`, `created_at`) values (2, 'Courier Delivery trungstaff', '/admin/courier/details/2', '2023-12-09 19:26:16', '2023-12-09 19:26:16')