app/Http/Controllers/Staff/CourierController.php

    public function sendWarehouse()
    {
        $user = Auth::user();
        $pageTitle = "Send Warehouse";
        $emptyMessage = "No data found";
        $courierLists = CourierInfo::where('sender_branch_id', $user->branch_id)->where('status',0)->orderBy('id', 'DESC')->with('senderBranch', 'receiverBranch', 'senderStaff', 'receiverStaff', 'paymentInfo')->paginate(getPaginate());
---
select * from `branches` where `branches`.`id` in (6)
select * from `courier_infos` where `sender_branch_id` = 6 and `status` = 0 order by `id` desc limit 20 offset 0
select count(*) as aggregate from `courier_infos` where `sender_branch_id` = 6 and `status` = 0

    public function search(Request $request)
    {
        $output = '';
        $couriers = CourierInfo::where('status', 6)
        ->where('receiver_branch_id', Auth::user()->branch_id)
        ->when($request->receiver_name, function ($query, $name) {
            return $query->where('receiver_name', $name);
        })
        ->when($request->receiver_phone, function ($query, $phone) {
            return $query->where('receiver_phone', $phone);
        })
        ->when($request->receiver_email, function ($query, $email) {
            return $query->where('receiver_email', $email);
        })
        ->when($request->receiver_address, function ($query, $address) {
            return $query->where('receiver_address', $address);
        })
        ->latest()->get();
---
select * from `courier_infos` where `status` = 6 and `receiver_branch_id` = 7 and `receiver_name` = 'Huy' and `receiver_phone` = '3458948' and `receiver_email` = 'huy@gmail.com' and `receiver_address` = 'HN' order by `created_at` desc