app/Http/Controllers/Staff/HomeController.php

select count(*) as aggregate from `branches` where `status` = 1
select count(*) as aggregate from `courier_infos` where `sender_staff_branch` = 14
select count(*) as aggregate from `courier_infos` where `receiver_staff_id` = 14
select sum(`amount`) as aggregate from `courier_payments` where `receiver_id` = 14
select * from `courier_infos` where `receiver_branch_id` = 6 order by `id` desc limit 5
---
    public function dashboard()
    {
        $user = Auth::user();
        $pageTitle = "Staff Dashboard";
        $emptyMessage = "No data found";
        $branchCount = Branch::where('status', 1)->count();
        $sendCourierCount = CourierInfo::where('sender_staff_branch', $user->id)->count();
        $receivedCourierCount = CourierInfo::where('receiver_staff_id', $user->id)->count();
        $cashCollection = CourierPayment::where('receiver_id', $user->id)->sum('amount');
        $courierDeliveys = CourierInfo::where('receiver_branch_id', $user->branch_id)->orderBy('id', 'DESC')->with('senderBranch','receiverBranch', 'senderStaff', 'receiverStaff', 'paymentInfo', 'senderStaffBranch')->take(5)->get();

select * from `branches` where `status` = 1 order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `branches` where `status` = 1
---
    public function branchList()
    {
        $pageTitle = "Branch List";
        $emptyMessage = "No data found";
        $branchs = Branch::where('status', 1)->latest()->paginate(getPaginate());