app/Http/Controllers/Manager/HomeController.php

select count(*) as aggregate from `users` where `user_type` = 'staff' and `branch_id` = 1
select sum(`amount`) as aggregate from `courier_payments` where `branch_id` = 1
select count(*) as aggregate from `courier_infos` where `receiver_branch_id` = 1 or `sender_branch_id` = 1
select * from `branches` where `branches`.`id` in (1)
select * from `courier_infos` where `receiver_branch_id` = 1 or `sender_branch_id` = 1 order by `id` desc limit 5
---
    public function dashboard()
    {
        $manager = Auth::user();
        $pageTitle = "Manager Dashboard";
        $emptyMessage = "No data found";
        $totalDeliveryManCount = User::where('user_type', 'delivery_man')->where('branch_id', $manager->branch_id)->count();
        $totalStaffCount = User::where('user_type', 'staff')->where('branch_id', $manager->branch_id)->count();
        $branchIncome = CourierPayment::where('branch_id', $manager->branch_id)->sum('amount');
        $courierInfoCount = CourierInfo::where('receiver_branch_id', $manager->branch_id)->orWhere('sender_branch_id', $manager->branch_id)->count();
        $courierInfos = CourierInfo::where('receiver_branch_id', $manager->branch_id)->orWhere('sender_branch_id', $manager->branch_id)->orderBy('id', 'DESC')->take(5)->with('senderBranch', 'receiverBranch', 'senderStaff', 'receiverStaff', 'paymentInfo')->get();

select count(*) as aggregate from `branches` where `status` = 1
---
    public function branchList()
    {
        $pageTitle = "Branch list";
        $emptyMessage = "No data found";
        $branchs = Branch::where('status', 1)->latest()->paginate(getPaginate());

select * from `branches` where `branches`.`id` in (6)
select * from `courier_infos` where `sender_branch_id` = 6 or `receiver_branch_id` = 6 order by `id` desc limit 20 offset 0
select count(*) as aggregate from `courier_infos` where `sender_branch_id` = 6 or `receiver_branch_id` = 6
---
    public function courierInfo()
    {
        $user = Auth::user();
        $pageTitle = "All Courier List";
        $emptyMessage = "No data found";
        $courierInfos = CourierInfo::where('sender_branch_id', $user->branch_id)->orWhere('receiver_branch_id', $user->branch_id)->orderBy('id', 'DESC')->with('senderBranch', 'receiverBranch', 'senderStaff', 'receiverStaff', 'paymentInfo')->paginate(getPaginate());

select count(*) as aggregate from `courier_infos` where `sender_branch_id` = 7
---
    public function sendCourier()
    {
        $user = Auth::user();
        $pageTitle = "Dispatch Courier List";
        $emptyMessage = "No data found";
        $courierInfos = CourierInfo::where('sender_branch_id', $user->branch_id)->orderBy('id', 'DESC')->with('senderBranch', 'receiverBranch', 'senderStaff', 'receiverStaff', 'paymentInfo')->paginate(getPaginate());

select * from `branches` where `branches`.`id` in (6)
select * from `courier_infos` where `receiver_branch_id` = 7 order by `id` desc limit 20 offset 0
select count(*) as aggregate from `courier_infos` where `receiver_branch_id` = 7
---
    public function receivedCourier()
    {
        $user = Auth::user();
        $pageTitle = "Upcoming Courier List";
        $emptyMessage = "No data found";
        $courierInfos = CourierInfo::where('receiver_branch_id', $user->branch_id)->orderBy('id', 'DESC')->with('senderBranch', 'receiverBranch', 'senderStaff', 'receiverStaff', 'paymentInfo')->paginate(getPaginate());