app/Http/Controllers/Manager_Warehouse/HomeController.php

    public function dashboard()
    {
        $manager_warehouse = Auth::user();
        $pageTitle = "Manager Warehouse Dashboard";
        $emptyMessage = "No data found";
        $warehouseListCount = Warehouse::where('status', 1)->count();
        $totalStaffCount =  User::where('user_type', 'staff_warehouse')->where('warehouse_id', $manager_warehouse->warehouse_id)->count();
        $courierInfoCount = CourierInfo::where('receiver_warehouse_id', $manager_warehouse->warehouse_id)->orWhere('sender_warehouse_id', $manager_warehouse->warehouse_id)->count();
        $branchCount = Branch::where('warehouse_id', $manager_warehouse->warehouse_id)->count();
        $courierInfos = CourierInfo::where('receiver_warehouse_id', $manager_warehouse->warehouse_id)->orWhere('sender_warehouse_id', $manager_warehouse->warehouse_id)->orderBy('id', 'DESC')->take(5)->with('senderBranch', 'receiverBranch', 'senderStaff', 'receiverStaff', 'paymentInfo', 'senderWarehouse')->get();
---
select count(*) as aggregate from `users` where `user_type` = 'staff_warehouse' and `warehouse_id` = 3
select count(*) as aggregate from `courier_infos` where `receiver_warehouse_id` = 3 or `sender_warehouse_id` = 3
select count(*) as aggregate from `branches` where `warehouse_id` = 1
select * from `branches` where `branches`.`id` in (6)
select * from `courier_infos` where `receiver_warehouse_id` = 3 or `sender_warehouse_id` = 3 order by `id` desc limit 5

    public function branchList()
    {
        $manager_warehouse = Auth::user();
        $pageTitle = "Branch list";
        $emptyMessage = "No data found";
        $branchs = Branch::where('status', 1)->where('warehouse_id', $manager_warehouse->warehouse_id)->latest()->paginate(getPaginate());
---
select * from `branches` where `status` = 1 and `warehouse_id` = 1 order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `branches` where `status` = 1 and `warehouse_id` = 1

    public function courierInfo()
    {
        $user = Auth::user();
        $pageTitle = "All Courier List";
        $emptyMessage = "No data found";
        $courierInfos = CourierInfo::where('sender_warehouse_id', $user->warehouse_id)->orWhere('receiver_warehouse_id', $user->warehouse_id)->orderBy('id', 'DESC')->with('senderWarehouse', 'receiverWarehouse', 'senderStaff', 'receiverStaff', 'paymentInfo', 'receiverBranch')->paginate(getPaginate());
---
select * from `courier_infos` where `sender_warehouse_id` = 3 or `receiver_warehouse_id` = 3 order by `id` desc limit 20 offset 0
select * from `warehouses` where `warehouses`.`id` in (3)
select count(*) as aggregate from `courier_infos` where `sender_warehouse_id` = 3 or `receiver_warehouse_id` = 3