app/Http/Controllers/Manager_Warehouse/StaffController.php

select * from `users` where `user_type` = 'staff_warehouse' and `warehouse_id` = 3 order by `created_at` desc limit 20 offset 0
select * from `warehouses` where `warehouses`.`id` in (3)
select count(*) as aggregate from `users` where `user_type` = 'staff_warehouse' and `warehouse_id` = 3
---
    public function index()
    {
        $pageTitle = "Manage Staff";
        $emptyMessage = "No data found";
        $manager_warehouse = Auth::user();
        $staffs = User::where('user_type', 'staff_warehouse')->where('warehouse_id', $manager_warehouse->warehouse_id)->with('warehouse')->latest()->paginate(getPaginate());