app/Http/Controllers/SiteController.php

    public function index(){
        $count = Page::where('tempname',$this->activeTemplate)->where('slug','home')->count();
        if($count == 0){
            $page = new Page();
            $page->tempname = $this->activeTemplate;
            $page->name = 'HOME';
            $page->slug = 'home';
            $page->save();
        }

        $reference = @$_GET['reference'];
        if ($reference) {
            session()->put('reference', $reference);
        }

        $pageTitle = 'Home';
        $sections = Page::where('tempname',$this->activeTemplate)->where('slug','home')->first();
---
select count(*) as aggregate from `pages` where `tempname` = 'templates.basic.' and `slug` = 'home'
select * from `pages` where `tempname` = 'templates.basic.' and `slug` = 'home' limit 1

    public function pages($slug)
    {
        $page = Page::where('tempname',$this->activeTemplate)->where('slug',$slug)->firstOrFail();
---
select * from `pages` where `tempname` = 'templates.basic.' and `slug` = 'login' limit 1

    public function contact()
    {
        $pageTitle = "Contact Us";
        $contact = Frontend::where('data_keys','contact_us.content')->firstOrFail();
---
select * from `frontends` where `data_keys` = 'contact_us.content' limit 1

    public function changeLanguage($lang = null)
    {
        $language = Language::where('code', $lang)->first();
---
select * from `languages` where `code` = 'vn' limit 1

    public function blog(){
        $pageTitle = "Blog";
        $blogs = Frontend::where('data_keys','blog.element')->paginate(9);
---
select * from `frontends` where `data_keys` = 'blog.element' limit 9 offset 0
select count(*) as aggregate from `frontends` where `data_keys` = 'blog.element'

    public function orderTracking(Request $request)
    {
        $pageTitle = "Order Tracking";
        $orderNumber = null;
        $courierProducts = [];
        $timeLog = [];
        if($request->order_number){
            $request->validate([
                'order_number' => 'required|exists:courier_infos,code',
            ]);
            $orderNumber = CourierInfo::where('code', $request->order_number)->first();
            if(!$orderNumber){
                $notify[] = ['success', 'Order Number Invalid'];
                return back()->withNotify($notify);
            }
            $courierProducts = CourierProduct::where('courier_info_id', getIdByNumber($request->order_number))->with('type')->get();
---
select * from `courier_infos` where `code` = 'MJAKK3KM1DS2' limit 1
select * from `courier_products` where `courier_info_id` = 22
select * from `types` where `types`.`id` in (2)