app/Http/Controllers/TicketController.php

select count(*) as aggregate from `support_tickets` where `user_id` = 19
---
    public function supportTicket()
    {
        if (!Auth::user()) {
            abort(404);
        }
        $user = Auth::user();
        $pageTitle = "Support Tickets";
        $emptyMessage = "No data found";
        $supports = SupportTicket::where('user_id', $user->id)->orderBy('priority', 'desc')->orderBy('id','desc')->paginate(getPaginate());