app/Http/Controllers/Delivery_Man/CourierController.php

    public function index()
    {
        $user = Auth::user();
        $pageTitle = "Couriers";
        $emptyMessage = "No data found";
        $courierLists = DeliveryCourier::where('user_id', $user->id)->where('status', 0)->with('courierInfo')->paginate(getPaginate());
---
select count(*) as aggregate from `delivery_couriers` where `user_id` = 22 and `status` = 0

    public function returnedIndex()
    {
        $user = Auth::user();
        $pageTitle = "Couriers";
        $emptyMessage = "No data found";
        $courierLists = DeliveryCourier::where('user_id', $user->id)->where('status', 3)->with('courierInfo')->paginate(getPaginate());
---
select count(*) as aggregate from `delivery_couriers` where `user_id` = 22 and `status` = 3

    public function details($id)
    {
        $pageTitle = "Courier Details";
        $courierInfo = CourierInfo::findOrFail(decrypt($id));
---
select * from `courier_infos` where `courier_infos`.`id` = 16 limit 1

    public function confirmMiss(Request $request)
    {
        $request->validate([
            'code' => 'required|exists:delivery_couriers,id',
            'reason' => 'required'
        ]);
        $user = Auth::user();
        $courier = DeliveryCourier::where('user_id', $user->id)->where('id', $request->code)->where('status', 0)->firstOrFail();
---
select * from `delivery_couriers` where `user_id` = 22 and `id` = '2' and `status` = 0 limit 1