app/Http/Controllers/Delivery_Man/HomeController.php

select count(*) as aggregate from `delivery_couriers` where `user_id` = 22
select count(*) as aggregate from `delivery_couriers` where `user_id` = 22 and `status` = 1
select count(*) as aggregate from `delivery_couriers` where `user_id` = 22 and `status` = 0
select count(*) as aggregate from `delivery_couriers` where `user_id` = 22 and `status` = 2
select * from `courier_infos` where `courier_infos`.`id` in (16)
select * from `delivery_couriers` where `user_id` = 22 limit 20 offset 0
---
    public function dashboard()
    {
        $user = Auth::user();
        $pageTitle = "Delivery Man Dashboard";
        $emptyMessage = "No data found";
        $shipmentCount = DeliveryCourier::where('user_id', $user->id)->count();
        $successfullCouriers = DeliveryCourier::where('user_id', $user->id)->where('status', 1)->count();
        $missionCount = DeliveryCourier::where('user_id', $user->id)->where('status', 0)->count();
        $returnsCount = DeliveryCourier::where('user_id', $user->id)->where('status', 2)->count();
        $courierLists = DeliveryCourier::where('user_id', $user->id)->with('courierInfo')->paginate(getPaginate());