app/Providers/AppServiceProvider.php

    public function boot()
    {
        $activeTemplate = activeTemplate();
        $general = GeneralSetting::first();
        $viewShare['general'] = $general;
        $viewShare['activeTemplate'] = $activeTemplate;
        $viewShare['activeTemplateTrue'] = activeTemplate(true);
        $viewShare['language'] = Language::all();
        $viewShare['pages'] = Page::where('tempname',$activeTemplate)->where('slug','!=','home')->get();
        $viewShare['footerPages'] = Page::where('tempname',$activeTemplate)->where('slug','!=','home')->orderby('id', 'DESC')->take(3)->get();
        view()->share($viewShare);


        view()->composer('admin.partials.sidenav', function ($view) {
            $view->with([
                'pending_ticket_count'         => SupportTicket::whereIN('status', [0,2])->count(),
            ]);
        });

        view()->composer('admin.partials.topnav', function ($view) {
            $view->with([
                'adminNotifications'=>AdminNotification::where('read_status',0)->with('user')->orderBy('id','desc')->get(),
            ]);
        });

        view()->composer('partials.seo', function ($view) {
            $seo = Frontend::where('data_keys', 'seo.data')->first();
---
select count(*) as aggregate from `support_tickets` where `status` in (0, 2)
select * from `admin_notifications` where `read_status` = 0 order by `id` desc
select * from `users` where `users`.`id` in (14)
select * from `frontends` where `data_keys` = 'seo.data' limit 1