app/Http/Controllers/Admin/AdminController.php

    public function dashboard()
    {
        $pageTitle = 'Dashboard';
        $branchCount = Branch::count();
        $branchs = Branch::latest()->take(5)->get();
        $courierInfoCount = CourierInfo::count();
        $managerCount = User::where('user_type', 'manager')->count();
        $totalIncome = CourierPayment::sum('amount');
        $userLoginData = UserLogin::where('created_at', '>=', \Carbon\Carbon::now()->subDay(30))->get(['browser', 'os', 'country']);
---
select count(*) as aggregate from `branches`
select * from `branches` order by `created_at` desc limit 5
select count(*) as aggregate from `courier_infos`
select count(*) as aggregate from `users` where `user_type` = 'manager'
select sum(`amount`) as aggregate from `courier_payments`
select `browser`, `os`, `country` from `user_logins` where `created_at` >= '2023-11-24 17:11:59'

    public function notificationRead($id){
        $notification = AdminNotification::findOrFail($id);
        $notification->read_status = 1;
        $notification->save();
---
select * from `admin_notifications` where `admin_notifications`.`id` = '1' limit 1
update `admin_notifications` set `read_status` = 1, `admin_notifications`.`updated_at` = '2023-12-09 17:25:50' where `id` = 1