app/Http/Controllers/Admin/BranchController.php

    public function index()
    {
        $pageTitle = "Manage Branch";
        $emptyMessage = "No data found";
        $branchs = Branch::latest()->with('warehouse')->paginate(getPaginate());;
---
select * from `branches` order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `branches`