app/Http/Controllers/Admin/CourierSettingController.php

    public function invoice($id)
    {
        $pageTitle = "Invoice";
        $courierInfo = CourierInfo::where('id', $id)->first();
        $courierProductInfos = CourierProduct::with('type')->where('courier_info_id', $courierInfo->id)->get();
        $courierPayment = CourierPayment::where('courier_info_id', $courierInfo->id)->first();
---
select * from `courier_payments` where `courier_payments`.`courier_info_id` in (13, 14, 16, 17, 18, 19)