app/Http/Controllers/Admin/CourierSettingController.php

select count(*) as aggregate from `units`
---
    public function unitIndex()
    {
        $pageTitle = "Manage Unit";
        $emptyMessage = "No data found";
        $units = Unit::latest()->paginate(getPaginate());

select * from `units` where `status` = 1 order by `created_at` desc
select * from `types` order by `created_at` desc limit 20 offset 0
select * from `units` where `units`.`id` in (1)
select count(*) as aggregate from `types`
---
    public function typeIndex()
    {
        $pageTitle = "Manage Courier Type";
        $emptyMessage = "No data found";
        $units = Unit::where('status', 1)->latest()->get();
        $types = Type::latest()->with('unit')->paginate(getPaginate());

select * from `branches` where `status` = 1 order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `branches` where `status` = 1
select * from `branches` where `branches`.`id` in (6, 7)
select * from `courier_infos` order by `id` desc limit 20 offset 0
select count(*) as aggregate from `courier_infos`
---
    public function courierInfo()
    {
        $pageTitle = "Courier Information";
        $emptyMessage = "No data found";
        $branchs = Branch::where('status', 1)->latest()->paginate(getPaginate());
        $courierInfos = CourierInfo::orderBy('id', 'DESC')->with('senderBranch', 'receiverBranch', 'senderStaffBranch', 'receiverStaff', 'paymentInfo')->paginate(getPaginate());

select * from `branches` where `status` = 1 order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `branches` where `status` = 1
select * from `branches` where `branches`.`id` in (6)
select * from `courier_infos` order by `id` desc limit 20 offset 0
select count(*) as aggregate from `courier_infos`
select * from `courier_infos` where `sender_branch_id` = '6' order by `id` desc limit 20 offset 0
select count(*) as aggregate from `courier_infos` where `sender_branch_id` = '6'
---
    public function courierBranchSelect(Request $request)
    {
        $pageTitle = "Courier Information";
        $emptyMessage = "No data found";
        $branchs = Branch::where('status', 1)->latest()->paginate(getPaginate());
        $courierInfos = CourierInfo::orderBy('id', 'DESC')->with('senderBranch', 'receiverBranch', 'senderStaff', 'receiverStaff', 'paymentInfo')->paginate(getPaginate());
        $branchId = $request->input('branchId');
        $senderOrReceiver = $request->input('senderOrReceiver');
        if($senderOrReceiver == 0 ){
            $courierInfos = CourierInfo::where('sender_branch_id', $branchId)->orWhere('receiver_branch_id', $branchId)->orderBy('id', 'DESC')->with('senderBranch', 'receiverBranch', 'senderStaff', 'receiverStaff', 'paymentInfo')->paginate(getPaginate());
        } else if ($senderOrReceiver == 1){
            $courierInfos = CourierInfo::where('sender_branch_id', $branchId)->orderBy('id', 'DESC')->with('senderBranch', 'receiverBranch', 'senderStaff', 'receiverStaff', 'paymentInfo')->paginate(getPaginate());