app/Http/Controllers/Admin/GeneralSettingController.php

    public function index()
    {
        $general = GeneralSetting::first();
---
select * from `general_settings` limit 1