app/Http/Controllers/Admin/WarehouseController.php

    public function store(Request $request)
    {
        $request->validate([
            'name' => 'required|max:40|unique:branches',
            'email' => 'required|email|max:40|unique:branches',
            'phone' => 'required|max:40|unique:branches',
            'address' => 'required|max:255',
        ]);

        $warehouse = new Warehouse();
        $warehouse->name = $request->name;
        $warehouse->email = $request->email;
        $warehouse->phone = $request->phone;
        $warehouse->address = $request->address;
        $warehouse->status = $request->status ? 1: 0;
        $warehouse->save();
---
insert into `warehouses` (`name`, `email`, `phone`, `address`, `status`, `updated_at`, `created_at`) values ('Kho Cầu Giấy', 'caugiay_wh@gmail.com', '0334531114', 'Xuân Thủy, Cầu Giấy, Hà Nội', 1, '2023-12-13 10:44:41', '2023-12-13 10:44:41')