app/Http/Controllers/Admin/WarehouseManagerController.php

select * from `users` where `users`.`id` = '8' limit 1
---
    public function edit($id)
    {
        $pageTitle = "Update Warehouse Manager";
        $warehouses = Warehouse::select('name', 'id')->where('status', 1)->latest()->get();
        $manager_warehouse = User::findOrFail($id);